#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
/************************************************/
//不用第三个变量，实现两数的对调操作
/************************************************/
int main()
{
	int a=0;
	int b=0;
	scanf("%d%d",&a,&b);
	printf("a=%d,b=%d",a,b);
	/**/
	a=a+b;
	b=a-b;
	a=a-b;
	/**/
	printf("a=%d,b=%d",a,b);


return 0;
}
/************************************************/
//要求输出如下结果：
//b=-1   a=65535
//a=65534
//a=30 b=6 c=5
/************************************************/
int main()
{
	short b=-1,c;
	unsigned short a;
	/**/
	a=b;
	printf("b=%d a=%u\n",b,a);//把有符号的短整型b转化为无符号的短整型a
	/**/
	a+=b;
	printf("a=%u\n",a);
	/**/
	b=(a=30)/(c=5);
	printf("a=%d b=%d c=%d",a,b,c);
		
return 0;
}
/************************************************/
//A, B
//65, 66
/************************************************/
int main()
{
	char a=0;
	/**/
	char b=0;
	/**/
	a='a';
	b='b';
	a=a-32;
	/**/
	b=b-32;
	printf("%c, %c\n%d, %d\n",a,b,a,b);

return 0;
}
/************************************************/
//从键盘上输入两个复数的实部和虚部，求出并输出它们的和、差、积、商。
/************************************************/
int main()
{
	float a,b,c,d,e,f;
	printf("输入第一个复数的实部和虚部:");
	scanf("%f", &a);
	scanf("%f", &b);
	printf("输入第二个复数的实部和虚部:");
	scanf("%f", &c);
	scanf("%f", &d);
	/**/
	e=a+c;
	f=b+d;
	printf("相加后复数的实部：%f虚部：%f",e,f);
	e=a*c-b*d;
	/**/
	f=a*d+b*c;
	printf("相乘后复数的实部：%f虚部：%f",e,f);
	e=(a*c+b*d)/(c*c+d*d);
	/**/
	f=(b*c-a*d)/(c*c+d*d);
	printf("相除后复数的实部：%f虚部：%f",e,f);

return 0;
}
/************************************************/
//实现功能：求解长方体的表面积和体积
/************************************************/
int main()
{
	double a,b,c,s,v;
	/**/
	scanf("%lf%lf%lf",&a,&b,&c);
	s=2*a*b+2*a*c+2*b*c;
	v=a*b*c;
	/**/
	printf("%f%f%f",a,b,c);
	/**/
	printf("%.2f%.2f",s,v);

return 0;
}
/************************************************/
//实现功能：计算三位正整数num的各位上的数字之积
/************************************************/
int main()
{
	int num=0;
	int ge=0;
	int shi=0;
	int bai=0;
	int s=0;
	printf("请输入一个正整数:>");
	/**/
	scanf("%d",&num);
	/**/
	bai=num/100;
	shi=num%100/10;
	ge=num%10;
	s=bai*shi*ge;
	printf("结果是：%d\n",s);

return 0;
}
/************************************************/
//实现功能：输入整数a和b，求解表达式3ab/[4(a+b)]-2a的值
/************************************************/
int main()
{
	int a=0;
	int b=0;
	float c=0;
	/**/
	scanf("%d%d",&a,&b);
	/**/
	c=3.0*a*b/(4*(a+b)-2.0*a);
	/**/
	printf("%f",c);

return 0;
}
/************************************************/
//义下面程序的功能是:
//从键盘输入学习成绩,如果学习成绩大于等于90分的用A表示,
//60-89之间的成绩用B表示，60分以下的用C表示。
//利用条件运算符的嵌套来完成。
/************************************************/
int main()
{
	int score=0;
	char grade=0;
    printf("please input a score:");
    /**/
    scanf("%d",score);
    grade= score>=90 ? 'A' : (score>=60 ? 'B' : 'C' );//x?y:z;
	printf("%d---%c\n",score,grade);

return 0;
}
